<?php

return [
    //Translations for Lesson Model
    'lesson' => [
        'store' => [
            'name' => [
                'required' => 'پر کردن فیلد نام درس اجباری است.',
                'string' => 'فیلد نام درس باید از نوع رشته ای باشد.',
                'max' => 'حداکثر تعداد قابل قبول برای فیلد :attribute :max کاراکتر میباشد.',
            ],
            'course_id' => [
                'required' => 'پر کردن فیلد دوره مرتبط اجباری است.',
                'integer' => 'فیلد دوره مرتبط باید از نوع عدد صحیح باشد.',
                'exists' => 'شناسه دوره وارد شده صحیح نمیباشد و یا چنین دوره ای موجود نیست.'
            ],
            'price' => [
                'required' => 'پر کردن فیلد قیمت اجباری است.',
                'between' => 'گزینه :attribute باید بین :min و :max باشد',
            ],
        ],
    ],

    //Global Translations
    'global' => [
        'price' => [
            'required' => 'پر کردن فیلد قیمت اجباری است.',
            'between' => 'گزینه :attribute باید بین :min و :max باشد',
        ],
        'operation_respond' => [
            'success' => [
                'create' => 'آیتم مورد نظر با موفقیت ایجاد شد.',
                'update' => 'آیتم مورد نظر با موفقیت ویرایش شد.'
            ],
            'failed' => [
                '404' => 'متأسفانه چنین موردی یافت نشد.لطفا ورودی های خود را کنترل کنید.'
            ]
        ],
    ],

];
